posts/emacs/index.html
<!DOCTYPE html>
<html prefix="og: http://ogp.me/ns# article: http://ogp.me/ns/article#
" lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Emacs | the lion blog</title>
<link href="../../assets/css/all-nocdn.css" rel="stylesheet" type="text/css">
<meta name="theme-color" content="#5670d4">
<meta name="generator" content="Nikola (getnikola.com)">
<link rel="alternate" type="application/rss+xml" title="RSS" href="../../rss.xml">
<link rel="canonical" href="https://mfuchs1.github.io/posts/emacs/">
<!--[if lt IE 9]><![endif]--><meta name="author" content="Matthias Fuchs">
<link rel="prev" href="../ein-zweiter-eintrag/" title="ein zweiter eintrag" type="text/html">
<meta property="og:site_name" content="the lion blog">
<meta property="og:title" content="Emacs">
<meta property="og:url" content="https://mfuchs1.github.io/posts/emacs/">
<meta property="og:description" content='Warum verwende Emacs / org-mode?


Nach regelmäßiger Nutzung von Emacs beginne ich erst zu verstehen, wie mächtig dieses Programm ist. Die Bezeichnung "Programm" greift jedoch zu kurz. Emacs ist mehr '>
<meta property="og:type" content="article">
<meta property="article:published_time" content="2020-04-17T21:01:59+02:00">
</head>
<body>
<a href="#content" class="sr-only sr-only-focusable">Skip to main content</a>

<!-- Menubar -->

<nav class="navbar navbar-expand-md static-top mb-4
navbar-dark bg-dark
"><div class="container">
<!-- This keeps the margins nice -->
        <a class="navbar-brand" href="https://mfuchs1.github.io/">

            <span id="blog-title">the lion blog</span>
        </a>
        <button class="navbar-toggler" type="button" data-toggle="collapse" data-target="#bs-navbar" aria-controls="bs-navbar" aria-expanded="false" aria-label="Toggle navigation">
            <span class="navbar-toggler-icon"></span>
        </button>

        <div class="collapse navbar-collapse" id="bs-navbar">
            <ul class="navbar-nav mr-auto">
<li class="nav-item">
<a href="../../archive.html" class="nav-link">Archive</a>
                </li>
<li class="nav-item">
<a href="../../categories/" class="nav-link">Tags</a>
                </li>
<li class="nav-item">
<a href="../../rss.xml" class="nav-link">RSS feed</a>

                
            </li>
</ul>
<ul class="navbar-nav navbar-right">
<li class="nav-item">
    <a href="index.org" id="sourcelink" class="nav-link">Source</a>
    </li>


                
            </ul>
</div>
<!-- /.navbar-collapse -->
    </div>
<!-- /.container -->
</nav><!-- End of Menubar --><div class="container" id="content" role="main">
    <div class="body-content">
        <!--Body content-->
        
        
        
<article class="post-text h-entry hentry postpage" itemscope="itemscope" itemtype="http://schema.org/Article"><header><h1 class="p-name entry-title" itemprop="headline name"><a href="." class="u-url">Emacs</a></h1>

        <div class="metadata">
            <p class="byline author vcard p-author h-card"><span class="byline-name fn p-name" itemprop="author">
                    Matthias Fuchs
            </span></p>
            <p class="dateline">
            <a href="." rel="bookmark">
            <time class="published dt-published" datetime="2020-04-17T21:01:59+02:00" itemprop="datePublished" title="2020-04-17 21:01">2020-04-17 21:01</time></a>
            </p>
            
        <p class="sourceline"><a href="index.org" class="sourcelink">Source</a></p>

        </div>
        

    </header><div class="e-content entry-content" itemprop="articleBody text">
    <div id="outline-container-org784fb67" class="outline-2">
<h2 id="org784fb67">Warum verwende Emacs / org-mode?</h2>
<div class="outline-text-2" id="text-org784fb67">
<p>
Nach regelmäßiger Nutzung von Emacs beginne ich erst zu verstehen, wie mächtig dieses Programm ist. Die Bezeichnung "Programm" greift jedoch zu kurz. Emacs ist mehr als nur ein Programm; es ist ein Texteditor, ein Email / Twitter - Client. Emacs verwaltet meine Unterrichtsplanung in org-mode. Mit Emacs kann ich im Internet "browsen"; würde ich programmieren können, so wäre Emacs eine ideale Entwicklungsumbegung. Ich kann in meinen Dateien stöbern (tolle Suchfunktion) - und innerhalb aller geöffneten Dateien nach bestimmten Wörtern oder Inhalten suchen. Für LaTex gibt es keinen besseren Editor als Emacs.
</p>

<p>
Am meisten verwende ich org-mode; dieser Modus innerhlab von Emacs hat meine Unterrichtsvorbereitung vereinfacht und effizienter gemacht. Jeder Stunde ist mit (internen) Links (#…) versehen, die Verweise zum Lehrplan und den verschiedenen Kompetenzen darstellen. 
</p>
</div>
</div>

<div id="outline-container-org8fd66a0" class="outline-2">
<h2 id="org8fd66a0">Seit wann verwende ich Emacs?</h2>
<div class="outline-text-2" id="text-org8fd66a0">
<p>
Das weiß ich nicht mehr. Lange Zeit habe ich einen großen Bogen um Emacs gemacht, mich haben wohl die Tastenkombinationen und die unüberschaubare Vielfalt der Einsatzmöglichkeiten abgeschreckt. Hin und wieder versuchte ich mich mit LaTex; dann erstellte ich ein paar kleine org-files. Ich schaute mir Tutorials auf YouTube an. So habe ich mich Schritt für Schritt an Emacs herangetastet. 
</p>

<p>
Gegen Ende meiner Ausbildung zum Lehrer überlegte ich, wie meine Unterrichtsvorbereitung aussehen sollte. Eines war mir sofort klar: ich will keine Schränke und Regale voller Mappen und kopierten Zetteln zuhause haben. So weit es möglich ist, sollte die Vorbereitung vollständig am Laptop und Desktop-PC laufen. 
</p>

<p>
Dank org-mode ist dies möglich. Während der letzten beiden Jahre habe ich meine org-files besser an meine Bedürfnisse angepasst - und natürlich auch an die veränderten Anforderungen des Lehrplans (Umstellung auf Kompetenz…). 
</p>
</div>
</div>

<div id="outline-container-org5681c5d" class="outline-2">
<h2 id="org5681c5d">Was möchte ich noch besser in org-mode integrieren?</h2>
<div class="outline-text-2" id="text-org5681c5d">
<p>
Genial wäre es, meine täglichen Aufzeichungen (Benotung, Mitarbeit, Verhalten) über die Schüler in org-mode zu verwalten. Es gibt sicher einen Weg, aus den Aufzeichnungen zu einer "konkreten" Note zu kommen.
</p>

<p>
Noch ein weiterer Texteditor.
</p>
</div>
</div>

<div id="outline-container-org685d189" class="outline-2">
<h2 id="org685d189">Seit ein bißchen mehr als einer Woche …</h2>
<div class="outline-text-2" id="text-org685d189">
<p>
arbeite ich mit einem neuen Laptop. Ich bin sehr zufrieden mit diesem Gerät: ein Lenovo V340, mit einer 520GB sehr schnellen Samsung SSD, einem i5 der 8. Generation und 16GB RAM. Manjaro KDE läuft sehr stabil, sieht einfach nur atemberaubend schön aus … Danke an alle! 
</p>
</div>
</div>
    </div>
    <aside class="postpromonav"><nav><ul class="pager hidden-print">
<li class="previous">
                <a href="../ein-zweiter-eintrag/" rel="prev" title="ein zweiter eintrag">Previous post</a>
            </li>
        </ul></nav></aside></article><!--End of body content--><footer id="footer">
            Contents © 2020         <a href="mailto:matthiasfuchs01@gmail.com">Matthias Fuchs</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         
            
            
        </footer>
</div>
</div>


        <script src="../../assets/js/all-nocdn.js"></script><script>
    baguetteBox.run('div#content', {
        ignoreClass: 'islink',
        captions: function(element) {
            return element.getElementsByTagName('img')[0].alt;
    }});
    </script>
</body>
</html>
